[
  {
    "id": "1725160455022",
    "title": "My Appreciation Of Life, Hence, My Desire To Create",
    "content": "# QUICK AUTHOR'S NOTE  (\"quick\" is relative - shh.)\r\nBlogging hasn't ever really been a dream of mine, but something about the environment it creates is exciting to me. The fact that everything I write gets published adds an element of caution and mindfulness that, to me, provokes a sense of creativity and encourages me to learn new things - and I just can't get all of that from journaling. \r\n\r\nI mean, think of a journal - it's locked away from the world, free from judgement, and reserved by nature. That's cool and all, but the act of making something public induces feelings that scream, \"it better be worth sharing!\" So, naturally, it makes you think twice about what you're putting down. This is what I want. This kind of environment is enthralling to me. And my favourite part is that it strikes the perfect balance between serious and fun (and by God, that's exactly what I need). Because, in the end, none of this is really for anyone in particular; there are no true stakes in writing the best post or thinking of the most eye-catching titles. It's simple, and thus, it's beautiful.\r\n\r\nIt's scary to be freed from the limitations of the superficial world (sounds corny, I know, but hear me out); getting to know the \"true you,\" whatever the hell that even means, can feel like skydiving - except stretched out over a lifetime. In saying that, I'm completely ignorant to the skydiving experience - but isn't that the point?\r\n\r\nI'm not sure if we'll ever truly understand who we are, or what we're made for. But - in a divinely humorous twist - I don't think that was ever the purpose of life (you'll be royally pissed to hear what I think it is).\r\n\r\n\r\n\r\n# MY APPRECIATION OF LIFE\r\nI think we all have our moments of digging deep into life's quandaries - why we do certain things, or what it all means. Sometimes a casual conversation can unexpectedly turn into a deep dive into the fundamentals of being. How funny is that? Why does it feel like everything is connected to something deeper? And what's with our predisposition to discover that? I think it's intrinsic to the human condition because of something I know of called: God.\r\n\r\nAnd what is God? (I know you've heard it many times before, but it's not going to stop me). God is the Way, the Truth, and the Life. Think about that. In other words, He is the light that shines upon the darkness which is the world. \r\n\r\nWhat is it that we feel when we are lost or confused? What is it that surrounds us when we feel lonely or abandoned? What is it that makes us question life itself? Surely, it cannot be anything but 'darkness'. A metaphorical darkness that every person knows all too well. One we fear more than the physical manifestation because we can't even see it. We can't touch it. We can't walk through it. It's not in front of us; it's inside of us. It's probably what you'd call spiritual. A spiritual darkness. And as we are made in the image of God, our mind and body relies on the state of our spirit. Of our soul. Even though you can trick yourself into believing you don't need it - it's something you literally cannot live without - and by live, I mean love in the purest form.\r\n\r\nBy having faith in God; by praising His name in all forms of devotion; by letting go and offering our lives to His omnipotence - you'll find that the 'darkness' within you slowly illuminates with the light that God offers you. All you have to do is learn to listen. \r\n\r\nStop asking so many bloody questions! Have faith! Good things come to those who wait, and to those who listen. Go out there and give thanks to the marvellous gift of living by experiencing life. All I ask is that you don't forget about Who gave it to you and you will be not be forgotten.\r\n\r\n“Man suffers only because he takes seriously what the gods made for fun.”\r\n― Alan Wilson Watts\r\n\r\n\r\n\r\n# HENCE, MY DESIRE TO CREATE\r\n“Advice? I don’t have advice. Stop aspiring and start writing. If you’re writing, you’re a writer. Write like you’re a g*ddamn death row inmate and the governor is out of the country and there’s no chance for a pardon. Write like you’re clinging to the edge of a cliff, white knuckles, on your last breath, and you’ve got just one last thing to say, like you’re a bird flying over us and you can see everything, and please, for God’s sake, tell us something that will save us from ourselves. Take a deep breath and tell us your deepest, darkest secret, so we can wipe our brow and know that we’re not alone. Write like you have a message from the king. Or don’t. Who knows, maybe you’re one of the lucky ones who doesn’t have to.”\r\n― Alan Wilson Watts\r\n\r\nMy desire to create comes from my appreciation for life. How may I be of service? That's really it. I don't feel the need to write a hundred more words. \r\n\r\nGratitude is the mother of all virtues. Don't fake it; go out and live it. That's the only way to truly experience it.\r\n\r\nI’ll conclude with my favourite words from Dostoyevsky, who, after being spared from his death sentence, poured his exultation into a stunning letter to his brother Mikhail:\r\n\r\n\"Brother! I’m not despondent and I haven’t lost heart. Life is everywhere, life is in us ourselves, not outside. There will be people by my side, and to be a human being among people and to remain one forever, no matter in what circumstances, not to grow despondent and not to lose heart — that’s what life is all about, that’s its task. I have come to recognize that. The idea has entered my flesh and blood… The head that created, lived the higher life of art, that recognized and grew accustomed to the higher demands of the spirit, that head has already been cut from my shoulders… But there remain in me a heart and the same flesh and blood that can also love, and suffer, and pity, and remember, and that’s life, too!\r\n\r\n[…]\r\n\r\nIf anyone remembers me with malice, and if I quarrelled with anyone, if I made a bad impression on anyone — tell them to forget about that if you manage to see them. There is no bile or spite in my soul, I would like to so love and embrace at least someone out of the past at this moment.\r\n\r\n[…]\r\n\r\nWhen I look back at the past and think how much time was spent in vain, how much of it was lost in delusions, in errors, in idleness, in the inability to live; how I failed to value it, how many times I sinned against my heart and spirit — then my heart contracts in pain. Life is a gift, life is happiness, each moment could have been an eternity of happiness. Si jeunesse savait! [If only the youth knew!]\"",
    "tags": [
      "existential"
    ],
    "date": "01/09/2024"
  }
]